### Terraform `plan` Succeeded for Workspace: `dev`
<details open><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_eip.nat[0] has changed
!   resource "aws_eip" "nat" {
+       association_id       = "eipassoc-0c76644854c184e64"
        id                   = "eipalloc-00bc186318624f466"
+       network_interface    = "eni-047c50014093b0391"
+       private_dns          = "ip-10-0-101-101.ap-northeast-2.compute.internal"
+       private_ip           = "10.0.101.101"
        tags                 = {
            "Name"        = "jingood2-dev-vpc-ap-northeast-2a"
            "environment" = "dev"
            "owners"      = "jingood2"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] has changed
!   resource "aws_route_table" "private" {
        id               = "rtb-05082c0748b89f1c0"
!       route            = [
+           {
+               carrier_gateway_id         = ""
+               cidr_block                 = "0.0.0.0/0"
+               destination_prefix_list_id = ""
+               egress_only_gateway_id     = ""
+               gateway_id                 = ""
+               instance_id                = ""
+               ipv6_cidr_block            = ""
+               local_gateway_id           = ""
+               nat_gateway_id             = "nat-0a4dc05cbf398e67c"
+               network_interface_id       = ""
+               transit_gateway_id         = ""
+               vpc_endpoint_id            = ""
+               vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name"        = "jingood2-dev-vpc-private"
            "environment" = "dev"
            "owners"      = "jingood2"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] has changed
!   resource "aws_route_table" "public" {
        id               = "rtb-021d5dc41b6e335d8"
!       route            = [
+           {
+               carrier_gateway_id         = ""
+               cidr_block                 = "0.0.0.0/0"
+               destination_prefix_list_id = ""
+               egress_only_gateway_id     = ""
+               gateway_id                 = "igw-0b46d8b1e283d6e6e"
+               instance_id                = ""
+               ipv6_cidr_block            = ""
+               local_gateway_id           = ""
+               nat_gateway_id             = ""
+               network_interface_id       = ""
+               transit_gateway_id         = ""
+               vpc_endpoint_id            = ""
+               vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name"        = "jingood2-dev-vpc-public"
            "environment" = "dev"
            "owners"      = "jingood2"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
!   resource "aws_internet_gateway" "this" {
        id       = "igw-0b46d8b1e283d6e6e"
        tags     = {
            "Name"        = "jingood2-dev-vpc"
            "environment" = "dev"
            "owners"      = "jingood2"
        }
!       vpc_id   = "vpc-0afdd044b892cd383" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] must be replaced
-/+ resource "aws_nat_gateway" "this" {
!       id                   = "nat-0a4dc05cbf398e67c" -> (known after apply)
!       network_interface_id = "eni-047c50014093b0391" -> (known after apply)
!       private_ip           = "10.0.101.101" -> (known after apply)
!       public_ip            = "3.38.222.147" -> (known after apply)
!       subnet_id            = "subnet-0a4bd7715df8030d2" -> (known after apply) # forces replacement
        tags                 = {
            "Name"        = "jingood2-dev-vpc-ap-northeast-2a"
            "environment" = "dev"
            "owners"      = "jingood2"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_route.private_nat_gateway[0] must be replaced
-/+ resource "aws_route" "private_nat_gateway" {
!       id                     = "r-rtb-05082c0748b89f1c01080289494" -> (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
!       nat_gateway_id         = "nat-0a4dc05cbf398e67c" -> (known after apply)
+       network_interface_id   = (known after apply)
!       origin                 = "CreateRoute" -> (known after apply)
!       route_table_id         = "rtb-05082c0748b89f1c0" -> (known after apply) # forces replacement
!       state                  = "active" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route.public_internet_gateway[0] must be replaced
-/+ resource "aws_route" "public_internet_gateway" {
!       id                     = "r-rtb-021d5dc41b6e335d81080289494" -> (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
!       origin                 = "CreateRoute" -> (known after apply)
!       route_table_id         = "rtb-021d5dc41b6e335d8" -> (known after apply) # forces replacement
!       state                  = "active" -> (known after apply)
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route_table.private[0] must be replaced
-/+ resource "aws_route_table" "private" {
!       arn              = "arn:aws:ec2:ap-northeast-2:783857413761:route-table/rtb-05082c0748b89f1c0" -> (known after apply)
!       id               = "rtb-05082c0748b89f1c0" -> (known after apply)
!       owner_id         = "783857413761" -> (known after apply)
!       propagating_vgws = [] -> (known after apply)
!       route            = [
-           {
-               carrier_gateway_id         = ""
-               cidr_block                 = "0.0.0.0/0"
-               destination_prefix_list_id = ""
-               egress_only_gateway_id     = ""
-               gateway_id                 = ""
-               instance_id                = ""
-               ipv6_cidr_block            = ""
-               local_gateway_id           = ""
-               nat_gateway_id             = "nat-0a4dc05cbf398e67c"
-               network_interface_id       = ""
-               transit_gateway_id         = ""
-               vpc_endpoint_id            = ""
-               vpc_peering_connection_id  = ""
            },
        ] -> (known after apply)
        tags             = {
            "Name"        = "jingood2-dev-vpc-private"
            "environment" = "dev"
            "owners"      = "jingood2"
        }
!       vpc_id           = "vpc-0afdd044b892cd383" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table.public[0] must be replaced
-/+ resource "aws_route_table" "public" {
!       arn              = "arn:aws:ec2:ap-northeast-2:783857413761:route-table/rtb-021d5dc41b6e335d8" -> (known after apply)
!       id               = "rtb-021d5dc41b6e335d8" -> (known after apply)
!       owner_id         = "783857413761" -> (known after apply)
!       propagating_vgws = [] -> (known after apply)
!       route            = [
-           {
-               carrier_gateway_id         = ""
-               cidr_block                 = "0.0.0.0/0"
-               destination_prefix_list_id = ""
-               egress_only_gateway_id     = ""
-               gateway_id                 = "igw-0b46d8b1e283d6e6e"
-               instance_id                = ""
-               ipv6_cidr_block            = ""
-               local_gateway_id           = ""
-               nat_gateway_id             = ""
-               network_interface_id       = ""
-               transit_gateway_id         = ""
-               vpc_endpoint_id            = ""
-               vpc_peering_connection_id  = ""
            },
        ] -> (known after apply)
        tags             = {
            "Name"        = "jingood2-dev-vpc-public"
            "environment" = "dev"
            "owners"      = "jingood2"
        }
!       vpc_id           = "vpc-0afdd044b892cd383" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.database[0] must be replaced
-/+ resource "aws_route_table_association" "database" {
!       id             = "rtbassoc-081dec78e7d66a0a3" -> (known after apply)
!       route_table_id = "rtb-05082c0748b89f1c0" -> (known after apply)
!       subnet_id      = "subnet-047eb0a0cb115935b" -> (known after apply) # forces replacement
    }

  # module.vpc.aws_route_table_association.database[1] must be replaced
-/+ resource "aws_route_table_association" "database" {
!       id             = "rtbassoc-03b8d229fcbedb223" -> (known after apply)
!       route_table_id = "rtb-05082c0748b89f1c0" -> (known after apply)
!       subnet_id      = "subnet-010ccbd33abaeceaf" -> (known after apply) # forces replacement
    }

  # module.vpc.aws_route_table_association.private[0] must be replaced
-/+ resource "aws_route_table_association" "private" {
!       id             = "rtbassoc-0f64f1d89b0b21c71" -> (known after apply)
!       route_table_id = "rtb-05082c0748b89f1c0" -> (known after apply)
!       subnet_id      = "subnet-0f7f68bfdf5369db5" -> (known after apply) # forces replacement
    }

  # module.vpc.aws_route_table_association.private[1] must be replaced
-/+ resource "aws_route_table_association" "private" {
!       id             = "rtbassoc-077b620b72ea75709" -> (known after apply)
!       route_table_id = "rtb-05082c0748b89f1c0" -> (known after apply)
!       subnet_id      = "subnet-002517e6fa703c3d1" -> (known after apply) # forces replacement
    }

  # module.vpc.aws_route_table_association.public[0] must be replaced
-/+ resource "aws_route_table_association" "public" {
!       id             = "rtbassoc-0adec2a8eaece928a" -> (known after apply)
!       route_table_id = "rtb-021d5dc41b6e335d8" -> (known after apply)
!       subnet_id      = "subnet-0a4bd7715df8030d2" -> (known after apply) # forces replacement
    }

  # module.vpc.aws_route_table_association.public[1] must be replaced
-/+ resource "aws_route_table_association" "public" {
!       id             = "rtbassoc-0f3874c2ab3d29cf4" -> (known after apply)
!       route_table_id = "rtb-021d5dc41b6e335d8" -> (known after apply)
!       subnet_id      = "subnet-02f42239030644ea7" -> (known after apply) # forces replacement
    }

  # module.vpc.aws_subnet.database[0] must be replaced
-/+ resource "aws_subnet" "database" {
!       arn                                            = "arn:aws:ec2:ap-northeast-2:783857413761:subnet/subnet-047eb0a0cb115935b" -> (known after apply)
!       availability_zone_id                           = "apne2-az1" -> (known after apply)
!       cidr_block                                     = "10.0.151.0/24" -> "10.1.151.0/24" # forces replacement
!       id                                             = "subnet-047eb0a0cb115935b" -> (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
-       map_customer_owned_ip_on_launch                = false -> null
!       owner_id                                       = "783857413761" -> (known after apply)
!       private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name"        = "jingood2-dev-vpc-db-ap-northeast-2a"
            "Type"        = "Private Database Subnets"
            "environment" = "dev"
            "owners"      = "jingood2"
        }
!       vpc_id                                         = "vpc-0afdd044b892cd383" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.database[1] must be replaced
-/+ resource "aws_subnet" "database" {
!       arn                                            = "arn:aws:ec2:ap-northeast-2:783857413761:subnet/subnet-010ccbd33abaeceaf" -> (known after apply)
!       availability_zone_id                           = "apne2-az3" -> (known after apply)
!       cidr_block                                     = "10.0.152.0/24" -> "10.1.152.0/24" # forces replacement
!       id                                             = "subnet-010ccbd33abaeceaf" -> (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
-       map_customer_owned_ip_on_launch                = false -> null
!       owner_id                                       = "783857413761" -> (known after apply)
!       private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name"        = "jingood2-dev-vpc-db-ap-northeast-2c"
            "Type"        = "Private Database Subnets"
            "environment" = "dev"
            "owners"      = "jingood2"
        }
!       vpc_id                                         = "vpc-0afdd044b892cd383" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] must be replaced
-/+ resource "aws_subnet" "private" {
!       arn                                            = "arn:aws:ec2:ap-northeast-2:783857413761:subnet/subnet-0f7f68bfdf5369db5" -> (known after apply)
!       availability_zone_id                           = "apne2-az1" -> (known after apply)
!       cidr_block                                     = "10.0.1.0/24" -> "10.1.1.0/24" # forces replacement
!       id                                             = "subnet-0f7f68bfdf5369db5" -> (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
-       map_customer_owned_ip_on_launch                = false -> null
!       owner_id                                       = "783857413761" -> (known after apply)
!       private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name"        = "jingood2-dev-vpc-private-ap-northeast-2a"
            "Type"        = "Private Subnets"
            "environment" = "dev"
            "owners"      = "jingood2"
        }
!       vpc_id                                         = "vpc-0afdd044b892cd383" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] must be replaced
-/+ resource "aws_subnet" "private" {
!       arn                                            = "arn:aws:ec2:ap-northeast-2:783857413761:subnet/subnet-002517e6fa703c3d1" -> (known after apply)
!       availability_zone_id                           = "apne2-az3" -> (known after apply)
!       cidr_block                                     = "10.0.2.0/24" -> "10.1.2.0/24" # forces replacement
!       id                                             = "subnet-002517e6fa703c3d1" -> (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
-       map_customer_owned_ip_on_launch                = false -> null
!       owner_id                                       = "783857413761" -> (known after apply)
!       private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name"        = "jingood2-dev-vpc-private-ap-northeast-2c"
            "Type"        = "Private Subnets"
            "environment" = "dev"
            "owners"      = "jingood2"
        }
!       vpc_id                                         = "vpc-0afdd044b892cd383" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] must be replaced
-/+ resource "aws_subnet" "public" {
!       arn                                            = "arn:aws:ec2:ap-northeast-2:783857413761:subnet/subnet-0a4bd7715df8030d2" -> (known after apply)
!       availability_zone_id                           = "apne2-az1" -> (known after apply)
!       cidr_block                                     = "10.0.101.0/24" -> "10.1.101.0/24" # forces replacement
!       id                                             = "subnet-0a4bd7715df8030d2" -> (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
-       map_customer_owned_ip_on_launch                = false -> null
!       owner_id                                       = "783857413761" -> (known after apply)
!       private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name"        = "jingood2-dev-vpc-public-ap-northeast-2a"
            "Type"        = "Public Subnets"
            "environment" = "dev"
            "owners"      = "jingood2"
        }
!       vpc_id                                         = "vpc-0afdd044b892cd383" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] must be replaced
-/+ resource "aws_subnet" "public" {
!       arn                                            = "arn:aws:ec2:ap-northeast-2:783857413761:subnet/subnet-02f42239030644ea7" -> (known after apply)
!       availability_zone_id                           = "apne2-az3" -> (known after apply)
!       cidr_block                                     = "10.0.102.0/24" -> "10.1.102.0/24" # forces replacement
!       id                                             = "subnet-02f42239030644ea7" -> (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
-       map_customer_owned_ip_on_launch                = false -> null
!       owner_id                                       = "783857413761" -> (known after apply)
!       private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name"        = "jingood2-dev-vpc-public-ap-northeast-2c"
            "Type"        = "Public Subnets"
            "environment" = "dev"
            "owners"      = "jingood2"
        }
!       vpc_id                                         = "vpc-0afdd044b892cd383" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] must be replaced
-/+ resource "aws_vpc" "this" {
!       arn                                  = "arn:aws:ec2:ap-northeast-2:783857413761:vpc/vpc-0afdd044b892cd383" -> (known after apply)
-       assign_generated_ipv6_cidr_block     = false -> null
!       cidr_block                           = "10.0.0.0/16" -> "10.1.0.0/16" # forces replacement
!       default_network_acl_id               = "acl-056b4fedb1ecb05c8" -> (known after apply)
!       default_route_table_id               = "rtb-084d92575539d19c4" -> (known after apply)
!       default_security_group_id            = "sg-0ae27bf661e52a32e" -> (known after apply)
!       dhcp_options_id                      = "dopt-01b84fc5706fc1c68" -> (known after apply)
!       enable_classiclink                   = false -> (known after apply)
!       enable_classiclink_dns_support       = false -> (known after apply)
!       id                                   = "vpc-0afdd044b892cd383" -> (known after apply)
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
-       ipv6_netmask_length                  = 0 -> null
!       main_route_table_id                  = "rtb-084d92575539d19c4" -> (known after apply)
!       owner_id                             = "783857413761" -> (known after apply)
        tags                                 = {
            "Name"        = "jingood2-dev-vpc"
            "environment" = "dev"
            "owners"      = "jingood2"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 18 to add, 1 to change, 18 to destroy.
```
</details>